PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_pmu.c
/*!
    \file    gd32f3x0_hal_pmu.c
    \brief   PMU driver

    \version 2023-08-01, V1.0.0, HAL firmware for GD32F3x0
*/

/*
    Copyright (c) 2023, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "gd32f3x0_hal.h"

/*!
    \brief      reset PMU peripheral
    \param[in]  pmu_dev: PMU device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     HAL_ERR_ADDRESS, HAL_ERR_NONE, details refer to gd32f3x0_hal.h
*/
int32_t hal_pmu_deinit(hal_pmu_dev_struct *pmu_dev)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == pmu_dev) {
        HAL_DEBUGE("pointer [pmu_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    pmu_dev->state = HAL_PMU_STATE_BUSY;
    /* deinit PMU */
    hal_rcu_periph_reset_enable(RCU_PMURST);
    hal_rcu_periph_reset_disable(RCU_PMURST);

    /* change PMU error state and state */
    pmu_dev->error_state = HAL_PMU_ERROR_NONE;
    pmu_dev->state = HAL_PMU_STATE_RESET;

    /* return function state */
    return HAL_ERR_NONE;
}

/*!
    \brief      initialize the PMU structure with the default values
    \param[in]  hal_struct_type: the argument could be selected from enumeration <hal_pmu_struct_type_enum>
    \param[out] p_struct: pointer to PMU structure that contains the configuration information
    \retval     none
*/
void hal_pmu_struct_init(hal_pmu_struct_type_enum hal_struct_type, void *p_struct)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == p_struct) {
        HAL_DEBUGE("pointer [*p_struct] value is invalid");
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    switch(hal_struct_type) {
    case HAL_PMU_INIT_STRUCT:
        /* initialize PMU initialization structure with the default values */
        ((hal_pmu_init_struct *)p_struct)->int_event_mode      = PMU_LVD_EVENT_MODE;
        ((hal_pmu_init_struct *)p_struct)->lvd_threshold       = PMU_LVDT_0;
        ((hal_pmu_init_struct *)p_struct)->trig_type           = PMU_LVD_TRIG_BOTH;
        break;
    case HAL_PMU_IRQ_STRUCT:
        /* initialize PMU IRQ structure with the default values */
        ((hal_pmu_lvd_irq_struct *)p_struct)->pmu_lvd_handle          = NULL;
        break;
    case HAL_PMU_DEV_STRUCT:
        /* initialize PMU device structure with the default values */
        ((hal_pmu_dev_struct *)p_struct)->pmu_lvd_irq.pmu_lvd_handle  = NULL;
        ((hal_pmu_dev_struct *)p_struct)->error_state                 = HAL_PMU_ERROR_NONE;
        ((hal_pmu_dev_struct *)p_struct)->state                       = HAL_PMU_STATE_NONE;
        ((hal_pmu_dev_struct *)p_struct)->mutex                       = HAL_MUTEX_UNLOCKED;
        ((hal_pmu_dev_struct *)p_struct)->priv                        = NULL;
        break;
    default:
        HAL_DEBUGW("parameter [hal_struct_type] value is undefine");
        break;
    }
}

/*!
    \brief      configure EXTI_16 and then configure low voltage detector threshold
    \param[in]  pmu_dev: PMU device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out]  pmu_lvd_init: the data needed to configure LVD
                  int_event_mode: PMU_INT_MODE, PMU_EVENT_MODE
                  trig_type: PMU_TRIG_RISING, PMU_TRIG_FALLING, PMU_TRIG_BOTH
                  lvd_threshold:
                  the argument could be selected from enumeration <hal_pmu_lvd_voltage_enum>
    \retval     HAL_ERR_ADDRESS, HAL_ERR_NONE, details refer to gd32f3x0_hal.h
*/
int32_t hal_pmu_lvd_init(hal_pmu_dev_struct *pmu_dev, hal_pmu_init_struct *pmu_lvd_init)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == pmu_dev) || (NULL == pmu_lvd_init)) {
        HAL_DEBUGE("pointer [pmu_dev] or pointer [pmu_lvd_init] address is invalid");
        /* return function state */
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    pmu_dev->state = HAL_PMU_STATE_BUSY;

    hal_exti_internal_deinit(EXTI_LINE_16_LVD);

    /* set the EXTI mode and enable events from EXTI line 16 */
    if(PMU_LVD_EVENT_MODE == pmu_lvd_init->int_event_mode) {
        EXTI_EVEN |= (uint32_t)EXTI_EVEN_EVEN16;
    }

    /* set the EXTI trigger type */
    switch(pmu_lvd_init->trig_type) {
    case PMU_LVD_TRIG_RISING:
        EXTI_RTEN |= (uint32_t)EXTI_RTEN_RTEN16;
        EXTI_FTEN &= ~(uint32_t)EXTI_FTEN_FTEN16;
        break;
    case PMU_LVD_TRIG_FALLING:
        EXTI_RTEN &= ~(uint32_t)EXTI_RTEN_RTEN16;
        EXTI_FTEN |= (uint32_t)EXTI_FTEN_FTEN16;
        break;
    case PMU_LVD_TRIG_BOTH:
        EXTI_RTEN |= (uint32_t)EXTI_RTEN_RTEN16;
        EXTI_FTEN |= (uint32_t)EXTI_FTEN_FTEN16;
        break;
    default:
        HAL_DEBUGE("parameter [pmu_lvd_init->trig_type] value is invalid");
        break;
    }

