PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_pmu.c
    hals_pmu_lvd_select(pmu_lvd_init->lvd_threshold);

    /* change PMU error state */
    pmu_dev->error_state = HAL_PMU_ERROR_NONE;
    /* change PMU state */
    pmu_dev->state = HAL_PMU_STATE_READY;

    /* return function state */
    return HAL_ERR_NONE;
}

/*!
    \brief      start LVD detector
    \param[in]  pmu_dev: PMU device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     HAL_ERR_ADDRESS, HAL_ERR_NONE, details refer to gd32f3x0_hal.h
*/
int32_t hal_pmu_lvd_start(hal_pmu_dev_struct *pmu_dev)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == pmu_dev) {
        HAL_DEBUGE("pointer [pmu_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */
    pmu_dev->state = HAL_PMU_STATE_BUSY;

    /* enable LVD */
    PMU_CTL |= PMU_CTL_LVDEN;

    pmu_dev->state = HAL_PMU_STATE_READY;
    /* return function state */
    return HAL_ERR_NONE;
}

/*!
    \brief      stop LVD detector
    \param[in]  pmu_dev: PMU device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     HAL_ERR_ADDRESS, HAL_ERR_NONE, details refer to gd32f3x0_hal.h
*/
int32_t hal_pmu_lvd_stop(hal_pmu_dev_struct *pmu_dev)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == pmu_dev) {
        HAL_DEBUGE("pointer [pmu_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */
    pmu_dev->state = HAL_PMU_STATE_BUSY;

    /* disable LVD */
    PMU_CTL &= ~PMU_CTL_LVDEN;
    EXTI_EVEN &= (uint32_t)~EXTI_EVEN_EVEN16;
    EXTI_INTEN &= (uint32_t)~EXTI_INTEN_INTEN16;
    hals_exti_interrupt_flag_clear(EXTI_LVD_16);

    pmu_dev->state = HAL_PMU_STATE_READY;

    /* return function state */
    return HAL_ERR_NONE;
}

/*!
    \brief      enable wakeup pin
    \param[in]  pmu_dev: PMU device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  wakeup_pin:
                one or more parameters can be selected which are shown as below:
      \arg        PMU_WAKEUP_PIN0: WKUP Pin 0 (PA0)
      \arg        PMU_WAKEUP_PIN1: WKUP Pin 1 (PC13)
      \arg        PMU_WAKEUP_PIN4: WKUP Pin 4 (PC5)
      \arg        PMU_WAKEUP_PIN5: WKUP Pin 5 (PB5)
      \arg        PMU_WAKEUP_PIN6: WKUP Pin 6 (PB15)
    \param[out] none
    \retval     none
*/
int32_t hal_pmu_wakeup_pin_enable(hal_pmu_dev_struct *pmu_dev, uint32_t wakeup_pin)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == pmu_dev)) {
        HAL_DEBUGE("pointer [pmu_dev] address is invalid");
        /* return function state */
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */
    pmu_dev->state = HAL_PMU_STATE_BUSY;

    PMU_CS |= wakeup_pin;

    /* change PMU error state */
    pmu_dev->error_state = HAL_PMU_ERROR_NONE;
    /* change PMU state */
    pmu_dev->state = HAL_PMU_STATE_READY;

    /* return function state */
    return HAL_ERR_NONE;
}

/*!
    \brief      disable wakeup pin
    \param[in]  pmu_dev: PMU device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  wakeup_pin:
                one or more parameters can be selected which are shown as below:
      \arg        PMU_WAKEUP_PIN0: WKUP Pin 0 (PA0)
      \arg        PMU_WAKEUP_PIN1: WKUP Pin 1 (PC13)
      \arg        PMU_WAKEUP_PIN4: WKUP Pin 4 (PC5)
      \arg        PMU_WAKEUP_PIN5: WKUP Pin 5 (PB5)
      \arg        PMU_WAKEUP_PIN6: WKUP Pin 6 (PB15)
    \param[out] none
    \retval     none
*/
int32_t hal_pmu_wakeup_pin_disable(hal_pmu_dev_struct *pmu_dev, uint32_t wakeup_pin)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == pmu_dev)) {
        HAL_DEBUGE("pointer [pmu_dev] address is invalid");
        /* return function state */
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */
    pmu_dev->state = HAL_PMU_STATE_BUSY;

    PMU_CS &= ~(wakeup_pin);

    /* change PMU error state */
    pmu_dev->error_state = HAL_PMU_ERROR_NONE;
    /* change PMU state */
    pmu_dev->state = HAL_PMU_STATE_READY;

    /* return function state */
    return HAL_ERR_NONE;
}

/*!
    \brief      PMU interrupt handler content function
    \param[in]  pmu_dev: PMU device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_pmu_lvd_irq(hal_pmu_dev_struct *pmu_dev)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == pmu_dev)) {
        HAL_DEBUGE("pointer [pmu_dev] address is invalid");
    }
#endif /* 1 = HAL_PARAMETER_CHECK */
    pmu_dev->state = HAL_PMU_STATE_BUSY;

    /* LVD interrupt handle */
    if(RESET != hals_exti_interrupt_flag_get(EXTI_LVD_16)) {
        hals_exti_interrupt_flag_clear(EXTI_LVD_16);

        if(NULL != pmu_dev->pmu_lvd_irq.pmu_lvd_handle) {
            pmu_dev->pmu_lvd_irq.pmu_lvd_handle(pmu_dev);
        }
    }
    /* change PMU error state */
    pmu_dev->error_state = HAL_PMU_ERROR_NONE;
    /* change PMU state */
    pmu_dev->state = HAL_PMU_STATE_READY;
}

/*!
    \brief      set user-defined interrupt callback function,
                which will be registered and called when corresponding interrupt be triggered
    \param[in]  pmu_dev: PMU device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  irq_handle: the callback handler of PMU interrupt
    \param[out] none
    \retval     none
*/
void hal_pmu_lvd_irq_handle_set(hal_pmu_dev_struct *pmu_dev, hal_pmu_lvd_irq_struct *irq_handle)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == pmu_dev) || (NULL == irq_handle)) {
        HAL_DEBUGE("pointer [pmu_dev] or [irq_handle] address is invalid");
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    if(NULL != irq_handle->pmu_lvd_handle) {
        pmu_dev->pmu_lvd_irq.pmu_lvd_handle = irq_handle->pmu_lvd_handle;
    } else {
        pmu_dev->pmu_lvd_irq.pmu_lvd_handle = NULL;
    }
}

/*!
    \brief      reset all user-defined interrupt callback function,
                which will be registered and called when corresponding interrupt be triggered
    \param[in]  pmu_dev: PMU device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  none
    \param[out] none
    \retval     none
*/
void hal_pmu_lvd_irq_handle_all_reset(hal_pmu_dev_struct *pmu_dev)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == pmu_dev)) {
        HAL_DEBUGE("pointer [pmu_dev] address is invalid");
    }
#endif /* 1 = HAL_PARAMETER_CHECK */
    pmu_dev->pmu_lvd_irq.pmu_lvd_handle = NULL;
}

/*!
    \brief      start PMU lvd with interrupt mode
    \param[in]  pmu_dev: PMU device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  irq_handle: the callback handler of PMU interrupt
    \param[out] none
    \retval     none
*/
int32_t hal_pmu_lvd_start_interrupt(hal_pmu_dev_struct *pmu_dev, hal_pmu_lvd_irq_struct *irq_handle)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == pmu_dev) || (NULL == irq_handle)) {
        HAL_DEBUGE("pointer [pmu_dev] or pointer [irq_handle] address is invalid");
    }
#endif /* 1 = HAL_PARAMETER_CHECK */
    HAL_LOCK(pmu_dev);
    /* enable LVD */
    PMU_CTL |= PMU_CTL_LVDEN;

    pmu_dev->pmu_lvd_irq.pmu_lvd_handle = irq_handle->pmu_lvd_handle;
    /* enable interrupt mode */
    if(NULL != pmu_dev->pmu_lvd_irq.pmu_lvd_handle) {
        EXTI_INTEN |= (uint32_t)EXTI_INTEN_INTEN16;
    } else {
        HAL_DEBUGE("pointer [irq_handle] address is invalid");
        return HAL_ERR_ADDRESS;
    }

